TestingStrategies-Particle/tests/Cases/nHeptaneDroplet/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    chemistrySolver ode;
    chemistryThermo psi;
}

chemistry       on;

initialChemicalTimeStep 1e-10;

EulerImplicitCoeffs
{
    cTauChem        1;
    equilibriumRateLimiter off;
}

odeCoeffs
{
    solver          rodas23;
    absTol          1e-12;
    relTol          0.0001;
}

reduction
{
    active          off;
    method          pNone;
}

tabulation
{
    active          off;
    method          pNone;
}


// ************************************************************************* //
